       IDENTIFICATION DIVISION.
       PROGRAM-ID. ABEND.
      *
      *    A program to call to abend abnormally
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-ALL-ASTERISKS          PIC X(79) VALUE ALL "*".
       01  WS-BOX-ASTERISKS.
           03  FILLER                PIC X(01) VALUE "*".
           03  FILLER                PIC X(03) VALUE ALL SPACES.
           03  WS-BOX-ASTERISKS-TEXT PIC X(71) VALUE ALL SPACES.
           03  FILLER                PIC X(03) VALUE ALL SPACES.
           03  FILLER                PIC X(01) VALUE "*".
      *
       77  WS-TERMINATION-MESSAGE    PIC X(71) VALUE ALL SPACES.
      *
       PROCEDURE DIVISION.
       0000-MAIN.
           DISPLAY WS-ALL-ASTERISKS UPON STDERR.
           DISPLAY WS-BOX-ASTERISKS UPON STDERR.
           MOVE "A B N O R M A L   E N D" TO WS-TERMINATION-MESSAGE.
           CALL "C$JUSTIFY" USING WS-TERMINATION-MESSAGE, "C"
           MOVE WS-TERMINATION-MESSAGE TO WS-BOX-ASTERISKS-TEXT.
           DISPLAY WS-BOX-ASTERISKS UPON STDERR.
           MOVE ALL SPACES TO WS-BOX-ASTERISKS-TEXT.
           DISPLAY WS-BOX-ASTERISKS UPON STDERR.
           DISPLAY WS-ALL-ASTERISKS  UPON STDERR.
       9999-ABNORMAL-END.
           STOP RUN WITH ERROR STATUS 255.
